{
  "title": "Portfólio",
  "subtitle": "Explore abaixo alguns dos projetos que desenvolvi e estão disponíveis online. Clique para acessar e conhecer cada um deles.",
  "warning": "⚠ Aviso: Alguns projetos podem não funcionar corretamente ou demorar para carregar caso dependam de serviços externos (como APIs ou back-ends hospedados) que foram desativados ou estão temporariamente indisponíveis.",
  "buttons": {
    "showMore": "Ver mais projetos",
    "showLess": "Ver menos"
  },
  "repos": {
    "github": "GitHub",
    "backend": "Back-end"
  },
  "projects": [
    {
      "id": "movie",
      "title": "Movie Catalog",
      "description": "Um site em React que exibe catálogos de filmes conectados à API do IMDb, permitindo buscar, explorar e visualizar detalhes dos filmes."
    },
    {
      "id": "copa",
      "title": "Análise de Imagens da Copa 2022",
      "description": "Aplicação React que analisa imagens relacionadas à Copa do Mundo de 2022 no Catar, trazendo insights visuais, informações extraídas."
    },
    {
      "id": "zaila",
      "title": "Zaila Chat",
      "description": "Um chatbot moderno desenvolvido em React, integrado com serviços de IA via Hugging Face e hospedado na Render, oferecendo respostas inteligentes, reconhecimento de voz e leitura em tempo real."
    },
    {
      "id": "axios",
      "title": "React Blog com Axios",
      "description": "Um blog construído em React usando Vite, consumindo dados da API pública JSONPlaceholder via Axios para exibir posts e informações dinâmicas."
    },
    {
      "id": "cost",
      "title": "Gestão de Custos de Projetos",
      "description": "Aplicação React para gerenciar e acompanhar os custos de projetos, permitindo adicionar projetos, definir orçamentos, acompanhar gastos de forma prática e intuitiva."
    },
    {
      "id": "quiz",
      "title": "Quiz de Programação",
      "description": "Aplicação desenvolvida em React com Vite que oferece quizzes interativos sobre HTML, CSS e JavaScript, permitindo escolher categorias e testar conhecimentos."
    },
    {
      "id": "flores",
      "title": "Análise de Flores",
      "description": "Aplicação web interativa baseada em um modelo treinado no Teachable Machine para identificar diferentes tipos de flores a partir de imagens da camera do usuário."
    },
    {
      "id": "folhas",
      "title": "Análise de Folhas",
      "description": "Aplicação web que usa um modelo do Teachable Machine (Google) para classificar e analisar imagens de folhas."
    },
    {
      "id": "farmUser",
      "title": "FarmGest - Consulta de Medicamentos",
      "description": "Aplicação em React para gestão de medicamentos de uma farmácia popular. Permite que a população consulte os remédios disponíveis usando login simples (ex.: user@gmail.com / senha: 123456)."
    },
    {
      "id": "farmAdmin",
      "title": "FarmGest - Painel Administrativo",
      "description": "Painel administrativo em React para a gestão interna da farmácia popular, permitindo o cadastro, atualização e remoção de medicamentos. Acesso via login admin (ex.: admin@gmail.com / senha: 123456)."
    },
    {
      "id": "denunciaAdmin",
      "title": "Canal de Denúncias Interno (Admin)",
      "description": "Aplicativo React para gestão interna de denúncias anônimas em uma empresa. Permite aos administradores adicionar usuários, visualizar denúncias e gerenciar o sistema. Acesso via login admin (ex.: admin@gmail.com / senha: 123456)."
    },
    {
      "id": "denunciaUser",
      "title": "Canal de Denúncias Interno (Usuário)",
      "description": "Aplicativo React para envio anônimo de denúncias internas. Usuários podem registrar uma denúncia e recebem um login/senha gerados automaticamente para acompanhar o andamento sem revelar identidade."
    },
    {
      "id": "escola",
      "title": "Escolachek (Chamada Escolar)",
      "description": "Aplicativo React integrado ao Firebase para controle de chamadas escolares. Permite marcar presença de alunos, gerar relatórios e acompanhar frequência. Acesso via login simples (ex.: user@gmail.com / senha: 123456)."
    },
    {
      "id": "ruralgest",
      "title": "RuralGest (Gestão Rural)",
      "description": "Aplicativo web em PHP com banco MySQL para gerenciamento financeiro de propriedades rurais. Permite registrar receitas, despesas, serviços e notas fiscais. Acesso via login simples (ex.: user@gmail.com / senha: 123456)."
    },
    {
      "id": "todo",
      "title": "Todo List",
      "description": "Aplicativo web em React para gerenciamento simples de tarefas (todo list). Permite adicionar, marcar como concluído e remover tarefas. Hospedado no Render para demonstração online."
    },
    {
      "id": "diabetes",
      "title": "Classificador de Diabetes",
      "description": "Aplicativo web em Flask que utiliza Machine Learning para prever o risco de diabetes com base em fatores de saúde. Permite ao usuário preencher um formulário e receber uma avaliação personalizada sobre seu risco estimado."
    }
  ]
}
